Учет_документов_20_Develop.ДокументыИТорги/src/Documents/РасшДТ_ВедомостьПередачиДокументов/РасшДТ_ВедомостьПередачиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасшДТ_ВедомостьПередачиДокументов</name>
  <registerRecords>AccumulationRegister.РасшДТ_ОборотыПоПодаркам</registerRecords>
  <registerRecords>InformationRegister.РасшДТ_КомуОтвезлиПодарки</registerRecords>
  <registerRecords>InformationRegister.РасшДТ_ДоставкаДокументовКурьером</registerRecords>
  <attributes>
    <name>ДокументыРазвозил</name>
    <type>
      <types>CatalogRef.РасшДТ_НашиСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок1</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок2</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок3</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиПодарков</name>
    <comment>Надо проверить отвозили ли этому клиенту подарок до определенной даты</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРазвозитьПодарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_СписокРазвоза</name>
    <attributes>
      <name>ПолучательДокументов</name>
      <type>
        <types>CatalogRef.РасшДТ_Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераАктов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераУПД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераДоговоров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛУРВы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомплектПоставки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СводныйАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктСверки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпециальнаяДоставка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОполучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньКлиента</name>
      <type>
        <types>EnumRef.РасшДТ_УровеньКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОбеда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_документов_20_Develop.ДокументыИТорги/src/InformationRegisters/РасшДТ_КомуОтвезлиПодарки/РасшДТ_КомуОтвезлиПодарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасшДТ_КомуОтвезлиПодарки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подарок1</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок1Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подарок2</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок2Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подарок3</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок3Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДокументыРазвозил</name>
    <type>
      <types>CatalogRef.РасшДТ_НашиСотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиПодарков</name>
    <comment>Надо проверить отвозили ли этому клиенту подарок до определенной даты</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРазвозитьПодарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПолучательДокументов</name>
    <type>
      <types>CatalogRef.РасшДТ_Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20_Develop.ДокументыИТорги/src/InformationRegisters/РасшДТ_ДоставкаДокументовКурьером/РасшДТ_ДоставкаДокументовКурьером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасшДТ_ДоставкаДокументовКурьером</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательДокументов</name>
    <type>
      <types>CatalogRef.РасшДТ_Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20_Develop.ДокументыИТорги/src/Documents/РасшДТ_ВедомостьПередачиДокументов/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии GNU GENERAL PUBLIC LICENSE
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр РасшДТ_КомуОтвезлиПодарки
	Движения.РасшДТ_КомуОтвезлиПодарки.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_СписокРазвоза из ТЧ_СписокРазвоза Цикл
		Движение = Движения.РасшДТ_КомуОтвезлиПодарки.Добавить();
		Движение.Период = Дата;
		Движение.ПолучательДокументов = ТекСтрокаТЧ_СписокРазвоза.ПолучательДокументов;
		Движение.Подарок1 = Подарок1;
		Движение.Подарок1Булево = ТекСтрокаТЧ_СписокРазвоза.Подарок1;
		Движение.Подарок2 = Подарок2;
		Движение.Подарок2Булево = ТекСтрокаТЧ_СписокРазвоза.Подарок2;
		Движение.Подарок3 = Подарок3;
		Движение.Подарок3Булево = ТекСтрокаТЧ_СписокРазвоза.Подарок3;
		Движение.ДокументыРазвозил = ДокументыРазвозил;
		Движение.ДатаПроверкиПодарков = ДатаПроверкиПодарков;
		Движение.ВремяРазвозитьПодарки = ВремяРазвозитьПодарки;
	КонецЦикла;

	// регистр РасшДТ_ОборотыПоПодаркам
	Движения.РасшДТ_ОборотыПоПодаркам.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_СписокРазвоза из ТЧ_СписокРазвоза Цикл
		Движение = Движения.РасшДТ_ОборотыПоПодаркам.Добавить();
		Движение.Период = Дата;
		Движение.ПолучательДокументов = ТекСтрокаТЧ_СписокРазвоза.ПолучательДокументов;
		Движение.Подарок1 = Подарок1;
		Движение.Подарок2 = Подарок2;
		Движение.Подарок3 = Подарок3;
		Движение.Подарок1Булево = ТекСтрокаТЧ_СписокРазвоза.Подарок1;
		Движение.Подарок2Булево = ТекСтрокаТЧ_СписокРазвоза.Подарок2;
		Движение.Подарок3Булево = ТекСтрокаТЧ_СписокРазвоза.Подарок3;
	КонецЦикла;

	// регистр РасшДТ_ДоставкаДокументовКурьером
	Движения.РасшДТ_ДоставкаДокументовКурьером.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_СписокРазвоза из ТЧ_СписокРазвоза Цикл
		Движение = Движения.РасшДТ_ДоставкаДокументовКурьером.Добавить();
		Движение.Период = Дата;
		Движение.Дата = Дата;
		Движение.АвторДокумента = ДокументыРазвозил;
		Движение.ПолучательДокументов = ТекСтрокаТЧ_СписокРазвоза.ПолучательДокументов;
		Движение.Наименование = ТекСтрокаТЧ_СписокРазвоза.Наименование;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
